/* 2557번 Hello World
Hello World!를 출력하시오.
*/

console.log("Hello World!");

/* 10718번 We love kriii
ACM-ICPC 인터넷 예선, Regional, 그리고 World Finals까지 이미 2회씩 진출해버린 kriii는 
미련을 버리지 못하고 왠지 모르게 올해에도 파주 World Finals 준비 캠프에 참여했다.
대회를 뜰 줄 모르는 지박령 kriii를 위해서 격려의 문구를 출력해주자.

두 줄에 걸쳐 "강한친구 대한육군"을 한 줄에 한 번씩 출력한다.

*/

console.log("강한친구 대한육군");
console.log("강한친구 대한육군");

/* 10171번 고양이 
아래 예제와 같이 고양이를 출력하시오.

\    /\
 )  ( ')
(  /  )
 \(__)|


*/

console.log(`\\    /\\
)  ( ')
(  /  )
\\(__)|`);

// 1) 백틱을 사용하면 여러줄 출력 가능. 2) \ 백슬래시 사용할 때는 두번 입력해야 제대로 출력이 됨.

/* 10172번 개 
아래 예제와 같이 개를 출력하시오.
|\_/|
|q p|   /}
( 0 )"""\
|"^"`    |
||_/=\\__|


백 슬래시 사용하기
\n : 줄 바꿈 (Enter)
\\ : 백 슬래시
\' : 작은 따옴표
\" : 큰 따옴표
*/

console.log(`|\\_/|
|q p|   /}
( 0 )"""\\
|"^"\`    |
||_/=\\\\__|`);

